## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # zentral_santa_rule.signingid-yes will be created
  + resource "zentral_santa_rule" "signingid-yes" {
      + configuration_id        = 1
      + custom_message          = "No yes 🕶️"
      + description             = "Say no to yes!"
      + excluded_primary_users  = []
      + excluded_serial_numbers = []
      + excluded_tag_ids        = []
      + id                      = (known after apply)
      + policy                  = "BLOCKLIST"
      + primary_users           = []
      + ruleset_id              = (known after apply)
      + serial_numbers          = []
      + tag_ids                 = []
      + target_identifier       = "platform:com.apple.yes"
      + target_type             = "SIGNINGID"
      + version                 = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>